include color
include time

blue ===================================
green    ФИНАЛЬНЫЙ АУДИТ ЯЗЫКА h
blue ===================================

say 1. Проверка времени:
now
say Текущий год:
year

say 2. Проверка математики:
sub 100 40
mul 10 3
div 20 4

say 3. Проверка массивов:
let my_list = [10, 20, 30]
say Первый элемент:
my_list[0]

say 4. Проверка функций:
func multiply(a, b)
  return a * b
end
say 5 умножить на 10:
multiply(5, 10)

say 5. Проверка циклов и условий:
for i in 1 5
  if i == 3
    say Нашли тройку!
  end
end

say 6. Проверка вибрации (если поддерживается):
vibrate 200

blue ===================================
red АУДИТ ЗАВЕРШЕН!
blue ===================================
