include color

blue =========================================
green       СИСТЕМА МОНИТОРИНГА TERMUX
blue =========================================

say 1. Загрузка модулей...
yellow ОК

say 2. Проверка соединения...
green УСПЕШНО

say 3. Анализ данных (тест массивов):
let server_load = [10, 25, 50]
let total = 0

add server_load[0] server_load[1]
add 35 server_load[2]

blue -----------------------------------------
say 4. Итоговый статус:
green ВСЕ СИСТЕМЫ РАБОТАЮТ
blue =========================================
